In [1]:
import pandas as pd
music_df_1= pd.DataFrame([{'Artist': 'The 1975', 'Genre': 'Indie Rock'},
{'Artist': 'The Bleachers', 'Genre':'Alternative/Indie'},
{'Artist': 'Passion Pit', 'Genre':'Electropop'}])

music_df_2 = pd.DataFrame([{'Artist': 'The Band Camino', 'Genre':'Alternative/Indie'},
{'Artist': 'LANY', 'Genre': 'Electropop'},
{'Artist': 'The Backseat Lovers', 'Genre': 'Rock'}])

        Artist_x              Genre             Artist_y
0       The 1975         Indie Rock                  NaN
1  The Bleachers  Alternative/Indie      The Band Camino
2    Passion Pit         Electropop                 LANY
3            NaN               Rock  The Backseat Lovers

In [2]:
dfa = pd.DataFrame({'Name':['Frank', 'Henry', 'Bob', 'Cat'], 'Class':['Math', 'Math', 'English', 'Physics'], 'Score':[90, 56, 78,92]})


dfb = pd.DataFrame({'Name':['Frank', 'Henry', 'Cat', 'Jeff'], 'Grade':['Junior', 'Senior', 'Sophomore', 'Junior']})

 

pd.merge(dfa, dfb, how='inner')

    Name    Class  Score      Grade
0  Frank     Math     90     Junior
1  Henry     Math     56     Senior
2    Cat  Physics     92  Sophomore

In [13]:
import numpy as np
df = pd.DataFrame({'Name': ['Kevin', 'Jennifer', 'Mike', 'Kate'],

                                'Income': [70000, 80000, 85000, 95000],
                                'Home State': ['MI', 'MI', 'WI', 'WI']})

df
df.groupby('Home State').agg(np.average).loc['MI']

Income    75000
Name: MI, dtype: int64

In [16]:
import pandas as pd
import numpy as np
#question1 - time stamp, time interval, duration

#np.datetime64('2015-07-04 12:59:59.50', 'ps')                 time stamp
#PeriodIndex                                                   time interval
#np.datetime64('2015-01-01') + pd.Timedelta('1M')              duration
#DatetimeIndex                                                 time stamp
#pd.period_range('2015-07', periods=8, freq='M')               time interval
#np.datetime64('2015-01-02') - np.datetime64('2015-01-01')     duration

NameError: name 'PeriodIndex' is not defined

In [14]:
#question2
dates = pd.date_range(start='2/1/2017', end='04/31/2017')
ts = pd.Series(np.random.randn(len(dates)), index=dates)
ts.resample('W')
#dates.resample('10T')
#dates.resample('2M')
#dates.resample('5H')

ValueError: could not convert string to Timestamp

In [10]:
#question3
index = pd.date_range('10-25-2020', periods=9, freq='D')
series = pd.Series(range(9), index=index)
series
series.resample('M',closed="left", label="right").apply(np.max)

2020-10-31    5
2020-11-30    8
Freq: M, dtype: int64

In [8]:
#question 4  = sunday
#question 5 = track 2
#question 6 
data = np.array([0, 1, 5, 5, 4, 2])
x = pd.Series(data)
x.rolling(3).apply(np.min)
x

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:7: FutureWarning: Currently, 'apply' passes the values as ndarrays to the applied function. In the future, this will change to passing it as Series objects. You need to specify 'raw=True' to keep the current behaviour, and you can pass 'raw=False' to silence this warning
  import sys

0    0
1    1
2    5
3    5
4    4
5    2
dtype: int64

In [15]:
import pandas as pd
import numpy as np

index = pd.date_range('2001-01-01', periods=90, freq='D')
data = pd.Series(np.random.randn(len(index)), index=index)
dataframe = pd.DataFrame(data)




data = data.resample('M')
dataframe = pd.DataFrame(data)
dataframe = dataframe.rename({0: 'Mean'}, axis='columns')
display(dataframe.mean())

Series([], dtype: float64)

In [16]:
import pandas as pd
import numpy as np

 

x = pd.Series(np.random.randn(4))

print(x.ndim)

1

In [17]:
team1 = pd.DataFrame([{'Name': 'Joe', 'Age': 23, 'Position': 'Point Guard'},
{'Name': 'Jim', 'Age': 20, 'Position': 'Shooting Guard'},
{'Name': 'Bob', 'Age': 24, 'Position': 'Small Forward'},
{'Name': 'Sam', 'Age': 28, 'Position': 'Power Forward'},
{'Name': 'Josh', 'Age': 23, 'Position': 'Center'}])

 

team2 = pd.DataFrame([{'Name': 'Tim', 'Age': 23, 'Position': 'Point Guard'},
{'Name': 'Tom', 'Age': 29, 'Position': 'Shooting Guard'},
{'Name': 'Glen', 'Age': 22, 'Position': 'Small Forward'},
{'Name': 'Nick', 'Age': 27, 'Position': 'Power Forward'},
{'Name': 'Sean', 'Age': 23, 'Position': 'Center'}])

display(team1)
display(team2)

   Name  Age        Position
0   Joe   23     Point Guard
1   Jim   20  Shooting Guard
2   Bob   24   Small Forward
3   Sam   28   Power Forward
4  Josh   23          Center

   Name  Age        Position
0   Tim   23     Point Guard
1   Tom   29  Shooting Guard
2  Glen   22   Small Forward
3  Nick   27   Power Forward
4  Sean   23          Center

In [26]:
df1 = pd.DataFrame({'cookie': ["Chocolate chip" , "Macadamia", "Oatmeal"], 'cake': ['chocolate', 'vanilla', 'lemon'], 'ice-cream': ['rocky road', 'peanut', 'oreo']})

df2 = pd.DataFrame({'cookie': ["Red-velvet" , "Milano", "M&M"], 'cake': ['black forest', 'strawberry cream', 'cheesecake'], 'ice-cream': ['moosetracks', 'honey lavender', 'basil']})
display(df1)
display(df2)
 
 
pd.merge(df1, df2, how='left', on='cake')

           cookie       cake   ice-cream
0  Chocolate chip  chocolate  rocky road
1       Macadamia    vanilla      peanut
2         Oatmeal      lemon        oreo

       cookie              cake       ice-cream
0  Red-velvet      black forest     moosetracks
1      Milano  strawberry cream  honey lavender
2         M&M        cheesecake           basil

         cookie_x       cake ice-cream_x cookie_y ice-cream_y
0  Chocolate chip  chocolate  rocky road      NaN         NaN
1       Macadamia    vanilla      peanut      NaN         NaN
2         Oatmeal      lemon        oreo      NaN         NaN

In [27]:
shows = {'Name': ['Narcos', 'The Walking Dead', 'Game of Thrones'], 'Rating': [9, 5, 8],
'Location': ['Columbia', 'USA', 'Westeros']}
shows_df = pd.DataFrame(data=shows)

 

shows_2 = {'Name': ['Narcos Mexico', 'The Walking Dead', 'Game of Thrones'], 'Rating': [7, 4, 10],
'Location': ['Mexico', 'USA', 'Spain']}
shows_2_df = pd.DataFrame(data=shows_2)

 

pd.merge(shows_df, shows_2_df, how='inner', on='Name')

               Name  Rating_x Location_x  Rating_y Location_y
0  The Walking Dead         5        USA         4        USA
1   Game of Thrones         8   Westeros        10      Spain

In [31]:
student_data1 = pd.DataFrame({
'student_id': [106, 107, 108, 109, 110],
'name': ['Student 1', 'Student 2', 'Student 3', 'Student 4', 'Student 5'],
'marks': [78, 89, 90, 87, 100]})

 

student_data2 = pd.DataFrame({
'student_id': [112, 113, 114, 115, 116],
'name': ['Johnson John', 'Manson Man', 'Daniel Dan', 'William Will', 'Ashley Ash'],
'marks': [67, 69, 99, 87, 90]})



merged_data = pd.merge(student_data1, student_data2, on='student_id', how='inner')

merged_data

Empty DataFrame
Columns: [student_id, name_x, marks_x, name_y, marks_y]
Index: []

In [32]:
x = pd.Series([0,8,2,5,4,2,7,6,5,9])
x.rolling(4).apply(np.max)

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Currently, 'apply' passes the values as ndarrays to the applied function. In the future, this will change to passing it as Series objects. You need to specify 'raw=True' to keep the current behaviour, and you can pass 'raw=False' to silence this warning

0    NaN
1    NaN
2    NaN
3    8.0
4    8.0
5    5.0
6    7.0
7    7.0
8    7.0
9    9.0
dtype: float64

In [37]:
df_states = pd.DataFrame([
{'State': 'Michigan', 'Capital': 'Lansing', 'Region':'Midwest'},
{'State': 'New York', 'Capital': 'Albany', 'Region':'Northeaset'},
{'State': 'Massachusetts', 'Capital': 'Boston', 'Region':'Northeaset'},
{'State': 'Georgia', 'Capital': 'Atlanta', 'Region':'South'}])

 

df_famous_cities = pd.DataFrame([
{'State': 'Michigan', 'City': 'Detroit', 'Food':'Detroit Pizza'},
{'State': 'Florida', 'City': 'Miami', 'Food':'Cuban Sandwich'},
{'State': 'Massachusetts', 'City': 'Boston', 'Food':'Lobster'},
{'State': 'Texas', 'City': 'Houston', 'Food':'Barbeque'}])


pd.merge(df_states, df_famous_cities, how='inner', left_on=['State', 'Capital'], right_on=['State', 'City'])

           State Capital      Region    City     Food
0  Massachusetts  Boston  Northeaset  Boston  Lobster

In [44]:
#Which of the following would be considered upsampling 

import pandas as pd
import numpy as np



for date in datelist:
    print(pd.to_datetime(date))

2020-01-13 00:00:00
2008-08-07 00:00:00
2010-10-31 00:00:00
2015-07-06 00:00:00

In [4]:
import pandas as pd
index = pd.date_range('10-25-2020', periods=9, freq= 'D')
index.resample('M', closed='left', label='right')

AttributeError: 'DatetimeIndex' object has no attribute 'resample'

In [6]:
import numpy as np
df = pd.DataFrame({'B':[0, 1, 2, np.nan, 4]})
df.rolling(2).sum()

     B
0  NaN
1  1.0
2  3.0
3  NaN
4  NaN

In [3]:


import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randint(0,20, size = (4,4)), columns=['A','B','C','D'])
df


avg = df['A'].apply(lambda x: x.mean)

    A   B   C   D
0  19   6   7  19
1   9   9   3   5
2  16   0  15  13
3   1  17  14  15

In [11]:
import pandas as pd
df=pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'],
index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good',
'ok', 'ok', 'ok', 'poor', 'poor'],
columns=["Grades"])
my_categories = pd.CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'],
ordered = True)
grades = df['Grades'].astype(my_categories)
grades

 
 	

 	

grades[grades > 'B-']

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
Name: Grades, dtype: category
Categories (11, object): [D < D+ < C- < C ... B+ < A- < A < A+]

In [12]:
df = pd.DataFrame({'a':['B','S','G','G','W'],'b':['S','L','Y','R','H'],'c':['I','R','U','E','I'],'d':['T','E','L','E','T'],'e':['K','D','F','N','E']})
df

   a  b  c  d  e
0  B  S  I  T  K
1  S  L  R  E  D
2  G  Y  U  L  F
3  G  R  E  E  N
4  W  H  I  T  E

In [19]:
dates = pd.date_range(start='1/1/2020', end='12/31/2020')
ts = pd.Series(np.random.randn(len(dates)), index=dates)
newdates = ts.resample('2W').apply(np.mean)
newdates

2020-01-05    0.009391
2020-01-19   -0.108410
2020-02-02    0.360644
2020-02-16   -0.133446
2020-03-01    0.492773
2020-03-15    0.455337
2020-03-29    0.253582
2020-04-12   -0.203275
2020-04-26   -0.339849
2020-05-10    0.144907
2020-05-24   -0.353030
2020-06-07    0.156646
2020-06-21   -0.127833
2020-07-05    0.029508
2020-07-19    0.081641
2020-08-02   -0.029893
2020-08-16   -0.278161
2020-08-30   -0.186599
2020-09-13   -0.302894
2020-09-27   -0.116457
2020-10-11    0.442540
2020-10-25   -0.007727
2020-11-08    0.145966
2020-11-22   -0.144201
2020-12-06   -0.195081
2020-12-20   -0.258431
2021-01-03   -0.085608
Freq: 2W-SUN, dtype: float64

In [1]:
import pandas as pd
my_cat = pd.CategoricalDtype(categories=['C', 'A', 'B', 'D', 'E'], ordered=True)
ranking[ranking < 'B']

NameError: name 'ranking' is not defined

In [1]:
import pandas as pd

In [2]:
df['GPA'].astype('category')

my_cats = pd.CategoricalDtype(categories=['0.0','1.0','1.3','1.7','2.0','2.3','2.7','3.0','3.3','3.7','4.0'], ordered=True)

gpas = df['GPA'].astype(my_cats)

df[df>'3.0']

NameError: name 'df' is not defined

In [5]:
import numpy as np

index = pd.date_range('01-01-2021', periods=28, freq='D')

s = pd.Series(np.random.randn(len(index)), index=index)
s

2021-01-01   -0.765600
2021-01-02    0.109986
2021-01-03    1.498600
2021-01-04   -0.398473
2021-01-05   -0.232475
2021-01-06   -0.285513
2021-01-07   -0.345788
2021-01-08   -1.228003
2021-01-09    0.386348
2021-01-10   -1.042735
2021-01-11   -0.439805
2021-01-12    1.191803
2021-01-13    1.363399
2021-01-14   -0.503271
2021-01-15   -1.561432
2021-01-16   -1.343643
2021-01-17   -1.079954
2021-01-18    1.043132
2021-01-19   -1.043082
2021-01-20   -0.313993
2021-01-21    0.346123
2021-01-22   -0.212193
2021-01-23   -0.369954
2021-01-24    1.304883
2021-01-25   -0.163355
2021-01-26    0.507506
2021-01-27    0.993506
2021-01-28    1.253337
Freq: D, dtype: float64

In [6]:


np.nanmean(s.loc[:pd.to_datetime('01-10-2021') + pd.Timedelta('4D')])

-0.04939483219595041

In [7]:
np.nanmean(s.iloc[:14])

-0.04939483219595041

In [8]:
sum(s.loc[:'01-14-2021']) / 14

-0.04939483219595041

In [9]:
np.nanmean(s.loc[:'01-15-2021'])

-0.15019728096613902

In [1]:
#original
def grade_calculator():
    s_quiz = 90 #final                                                                                 # 110 pts. Python Assessment and Syllabus Quiz 
    part = 40 + 40 +80 + 70 + 30 + 40 +90 + 30 + 60 + 70 + 80 + 80 #final                              # 19 x 60 pts. = 1140 pts. Participation: Clicker Questions/Discussion Forum 
    lab = 2500 #final                                                                                   # 10 x 250 pts. = 2500 pts. Lab Sections (see breakdown on pg. 5) 
    assign = 200 + 70 + 450 + 490 + 460 + 390 + 500 + 480 + 420 + 410 #final                          # 10 x 500 pts. = 5000 pts. Assignments (Individual/Group)
    chall = 0                                                                                       # 9 x 200 pts. = 1800 pts. Challenge Problems 
    peerwise = 1040 #final                                                                        # 11 x 120 pts. + 270 pts. = 1590 pts. PeerWise Generation/Review + Badges
    end_eval = 80  #final                                                                           # 160 pts. End-of-Course Evaluation and Reflection 
    midterm = 790 #final                                                                  # 1000 pts. Midterm Conferences 
    final = 850
    # 1000 pts. Final Conferences OR 1650 pts. Project* (Individual/Group)
    expoints = 10 #final
    return s_quiz + part + lab + assign + chall + peerwise + end_eval + midterm + final + expoints
grade_calculator()

# >= 11200 pts. A+ (75%)*
# 10200 pts. A (68%)*
# 9600 pts. A- (64%)*
# 9000 pts. B+ (60%)*
# 8500 pts. B (57%)
# 8000 pts. B- (53%)

9940

710

In [4]:
#bestcase
def grade_calculator():
    s_quiz = 90 #final                           # 110 pts. Python Assessment and Syllabus Quiz 
    part = 700                                   # 19 x 60 pts. = 1140 pts. Participation: Clicker Questions/Discussion Forum 
    lab = 2500 #most likely to be full points    # 10 x 250 pts. = 2500 pts. Lab Sections (see breakdown on pg. 5) 
    assign = 3800                                # 10 x 500 pts. = 5000 pts. Assignments (Individual/Group)
    chall = 0                                    # 9 x 200 pts. = 1800 pts. Challenge Problems 
    peerwise = 1210                             # 11 x 120 pts. + 270 pts. = 1590 pts. PeerWise Generation/Review + Badges
    end_eval = 160                               # 160 pts. End-of-Course Evaluation and Reflection 
    midterm = 790 #final                         # 1000 pts. Midterm Conferences 
    final = 800                                  # 1000 pts. Final Conferences OR 1650 pts. Project* (Individual/Group)
    expoints = 10
    return s_quiz + part + lab + assign + chall + peerwise + end_eval + midterm + final + expoints
grade_calculator()

# >= 11200 pts. A+ (75%)*
# 10200 pts. A (68%)*
# 9600 pts. A- (64%)*
# 9000 pts. B+ (60%)*
# 8500 pts. B (57%)
# 8000 pts. B- (53%)

10060

In [2]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330
import psycopg2
import sqlalchemy
import pandas as pd

In [22]:
%%sql
DROP TABLE IF EXISTS mens_baseball_homeruns;

CREATE TABLE mens_baseball_homeruns(
    school varchar(255),
    num_homeruns integer  
);

INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Illinois', 16);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Nebraska', 30);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Northwestern', 36);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Michigan State', 5);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Michigan', 18);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Indiana', 15);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Maryland', 24);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Penn State', 14);
INSERT INTO mens_baseball_homeruns (school, num_homeruns) VALUES ('Minnesota', 11);


SELECT num_homeruns from mens_baseball_homeruns where school like 'Michigan%'

 * postgres://jovyan:***@localhost:5432/si330
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
2 rows affected.

[(5,), (18,)]

In [ ]:
SELECT school from mens_baseball_homeruns where school like 'Michigan%'

In [24]:
%%sql
DROP TABLE IF EXISTS field_hockey_scorers;

create table field_hockey_scorers (
    name varchar(255),
    school varchar(255),
    games_played int,
    num_goals int,
    average_per_game float
);

insert into field_hockey_scorers values('Bente Baekers', 'Northwestern', 8, 41, 5.13);
insert into field_hockey_scorers values('Mackenzie Allessie', 'Ohio State', 6, 27, 4.5);
insert into field_hockey_scorers values('Sophia Gladieux', 'Penn State', 9, 29, 3.22);
insert into field_hockey_scorers values('Anna Simon', 'Penn State', 9, 28, 3.11);
insert into field_hockey_scorers values('Maddy Murphy', 'Iowa', 12, 31, 2.58);
insert into field_hockey_scorers values('Hallie ONeill', 'Michigan', 9, 23, 2.56);
insert into field_hockey_scorers values('Sophia Gladieux', 'Penn State', 9, 29, 3.22);
insert into field_hockey_scorers values('Maddie Zimmer', 'Northwestern', 8, 20, 2.5);
insert into field_hockey_scorers values('Riley Donnelly', 'Maryland', 10, 24, 2.4);
insert into field_hockey_scorers values('Peyton Halsey', 'Northwestern', 8, 19, 2.38);
insert into field_hockey_scorers values('Mackenzie Keegan', 'Northwestern', 8, 17, 2.13);

SELECT sum(num_goals) from field_hockey_scorers where games_played >= 9

 * postgres://jovyan:***@localhost:5432/si330
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[(164,)]

In [24]:
%%sql

DROP TABLE IF EXISTS video_games;

create table video_games(
    title varchar(255),
    genre varchar(255),
    hours_played integer
);

INSERT INTO video_games (title, genre, hours_played) VALUES ('Among Us', 'Strategy', 60);
INSERT INTO video_games (title, genre, hours_played) VALUES ('Call of Duty', 'Shooter', 86);
INSERT INTO video_games (title, genre, hours_played) VALUES ('Assassins Creed', 'Action-Adventure', 32);
INSERT INTO video_games (title, genre, hours_played) VALUES ('Halo', 'Shooter', 72);
INSERT INTO video_games (title, genre, hours_played) VALUES ('Minecraft', 'Action-Adventure', 27);
INSERT INTO video_games (title, genre, hours_played) VALUES ('Fortnite', 'Shooter', 54);


SELECT sum(hours_played) FROM video_games where genre like 'Shooter%'

 * postgres://jovyan:***@localhost:5432/si330
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[(212,)]

In [24]:
%%sql

DROP TABLE IF EXISTS myth_locations;

create table myth_locations(
    name varchar(255),
    lat float,
    long float,
    terrain varchar(255)
);

INSERT INTO myth_locations (name, lat, long, terrain) VALUES ('Atlantis', 123.47, 532.96, 'Water');
INSERT INTO myth_locations (name, lat, long, terrain) VALUES ('Narnia', 37.57, 87.11, 'Land');
INSERT INTO myth_locations (name, lat, long, terrain) VALUES ('Mt. Olympus', 380.60, 444.44, 'Land');
INSERT INTO myth_locations (name, lat, long, terrain) VALUES ('Big Foot', -128.66, -10.02, 'Land');
INSERT INTO myth_locations (name, lat, long, terrain) VALUES ('Lochness Monster', 170.32, 101.02, 'Water');

SELECT * FROM myth_locations

 * postgres://jovyan:***@localhost:5432/si330
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[('Atlantis', 123.47, 532.96, 'Water'),
 ('Narnia', 37.57, 87.11, 'Land'),
 ('Mt. Olympus', 380.6, 444.44, 'Land'),
 ('Big Foot', -128.66, -10.02, 'Land'),
 ('Lochness Monster', 170.32, 101.02, 'Water')]

In [23]:
%%sql
SELECT name FROM myth_locations WHERE lat > (100) AND long > (100)

 * postgres://jovyan:***@localhost:5432/si330
3 rows affected.

[('Atlantas',), ('Mt. Olympus',), ('Lochness Monster',)]